BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>XAay6QbUR8G1RZaDu4rjWLPDHRJ4TCFsQajozBICxO5tKnEBEklpBMpYXIsYmmK4srHVoX1xNcDV&#13;
bhH2IKdwtOcgugKFmoe+Cz7abDIsHsmcyyj+GQZQqawWpA7Wf6+YIuvq3bRMZvEb8cS6WqlKzmnm&#13;
NOynf/1TbKi5s8PAupXmqm20dxzvtQLPAgK5+Dpp3lFQSeb8Oy+U6b4QoQumAXo7JpTd3AscEZAJ&#13;
uMIL65ULl2Znv6NRscsac++OYRAhi/c2xje2018T86UYyCo0M0TrBE6dp2m0UPoNUNdysFarBiv2&#13;
TXPDWUqkOBYbJAtBHK6VIZwXZ8yqI0XTiYfuLA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>4wZzhnYff/izUZL4/aC7QtKgNnMZdTun+wARMBUQSZS81DBED06BrgVLOHMxJ7sHt9He+DBlQXRa&#13;
05/a0CzH2MX5xccUg0y4FsuauhaPP+YFGlKjO+iAGsoGquiV+sxaaXMqUyMw5BtFsUL9EDhiLXi1&#13;
RxdGujIxLnPoNnBwEfdbN4OSsD1+1DNI6Y4xb+jaxpwiK6U0HFUH4FIawqZcbTsrPffCPqNqBoAc&#13;
0qX6IQx0SFYOy1J7Zdqf0mvjEoQwQMtrX2IIQh7TmlvwpwIUpm3RyrBP6ob+GmaiqxTRMTr5GPSI&#13;
CA7mMK6hFuKKBdfSuTv2lKN3/v9kM2gOm4ESfn/5Xh4i+4mG6sa4yxx7/UWyb92bquIDIkr9Ah81&#13;
N2pg0NKkGSfPO39FMBhS8oYedrDCLPkIHCSegXDbl7/KIGO/YRR4xMUfV5nQo9RKfeh75YMLmcQ7&#13;
6X2qNpcISr/Gd+eUeMHIYe9+8WTp/e7fsQrTjUGVH4Sc7nXCT07v2uN5hNY3cSK63bvD/nWm9Zuj&#13;
YrVC5zgD8UbvFJnr7IaPIp9ZQsVyL0zanJeVOELHgf/wsEy7WlgOt5ZPSo9WlXPHR4GBQ0jw7E6h&#13;
5vj3zDLnWrtfn6NOzUuUd2mMXtdr3xHOoSA0B7NbMROY5UCmGTzjyHGxb1zYz6/medRVhOBMgQRG&#13;
4p/Y++t1mwE9/s6Og3lpHxtPnl/Ios9DtrmLEbtletX50aEqYfMnqM1d3+cPAAIgA9vTdqC89LWW&#13;
152HN4eBBYXSilN4p8rQ1d+fVX9gK5nZcK8ybvFZftPX0O59lkJTFtAU4zglkwFQyEmH8x6DjN9r&#13;
J8qt7aC22RjsACDVMKgWbIjkW37+Be8VWuIJWrKJfgoAQfA3UlQ5bogbzZZVNrDzvptYC6ETtodY&#13;
EDc9NJUU7LEbehvtiAAoAs+QVXzHe2I8F9RIdPW0pGCN+Wa1od40C363GhEI7hjChwn1fo1oZycs&#13;
1FTjef93/FMTagnris5n2hbpTQSFLFgGtZhDHu1qOGNB050F9uHp/aTQvxVfh+Ap2X1fxqys8haZ&#13;
c1PCjYqRlvrfXUnTfRA1giVIA+fqSKbIEqoQ4RqDew3/Hp3i1fY5Ya+h5Ohp+1bSFWgbz1EdFsEj&#13;
FHyip6iCETM0Z7JDxOQk4HImvU18Ue5gziY6N+lxdRmCvusXLq4/m3b8tyXumIwUeeYExuPVBJHV&#13;
axu+p7jm8IvlAoAADjslHGfFpR8k3lq+eHCLfq3jJvXOq16C1wHZCiMXujTMqh2mgh2acQexevpf&#13;
IeAA6008zflQUkWTUrDOtukZD4fSAxmjeYQXYpoasNet/6kSVdrOBLBfDbp16dCThh9Rc2AG/w==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>iQ5CZ2vvSXnA8krsHyiv0bFHaEU=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
L3Jl3EIQDtzd2IU5yeQ2qZej+93/cOA0F7R74iPkabQV2eJT7zix2QS/wbpjAUiQbGehOgmolCUM&#13;
gxgF4JiRiLB2BBYywhrM3mbyOuYbWNzsL2bguUwtoA1c9dNiF6QVDAm8inqPIuh+X9BCNveNRxMw&#13;
/7XCiYe53nla+z5Le6QFxcTPZLY/DeTQ/ZKH43qu51fno+tEm/Esg1Z6Ecs4IdKhUIAtNF42oruE&#13;
5G6ZohEQDTa44eCfsY4ByiS+jKF4ZGT5B4CUX15IIysuf8UA2S107EJc4I9HYr63C5eIccm2QyRX&#13;
JKSt/+GEKxJ9S1UWUk8IB0FsUVTbc2NgWtonqQ==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>